app/Controllers/Expense.php

    public function index()
    {
        $data = [
            'title' => 'Pocketify - Pencatatan Pengeluaran Mahasiswa',
            'expenses' => $this->expenseModel->orderBy('date', 'DESC')->findAll()
---
SELECT *
FROM `expenses`
ORDER BY `date` DESC

    public function delete($id)
    {
        $this->expenseModel->delete($id);
---
DELETE FROM `expenses`
WHERE `id` IN ('1')