app/Controllers/SignUp.php

    public function process()
    {
        // Load helper for form and URL
        helper(['form', 'url']);

        // Validation rules
        $validationRules = [
            'full_name'        => 'required|min_length[3]|max_length[100]',
            'email'            => 'required|valid_email|is_unique[users.email]',
            'password'         => 'required|min_length[8]',
            'confirm_password' => 'required|matches[password]',
        ];

        if (!$this->validate($validationRules)) {
            // Validation failed
            return view('signup', ['validation' => $this->validator]);
        }

        // Save user to the database
        $db = \Config\Database::connect();
        $builder = $db->table('users');

        $data = [
            'full_name' => $this->request->getPost('full_name'),
            'email'     => $this->request->getPost('email'),
            'password'  => password_hash($this->request->getPost('password'), PASSWORD_BCRYPT),
        ];

        $builder->insert($data);
---
INSERT INTO `users` (`full_name`, `email`, `password`) VALUES ('Test3', 'test3@gmail.com', '$2y$10$VI7oVQ11T890tbaC0HtusOzpYhAsf3yDR2NZz1t7MJilAGCCeNy3a')