app/Controllers/Todo.php

SELECT *
FROM `tasks`
WHERE `user_id` = '5'
---
    public function index()
    {
        $db = \Config\Database::connect();
        $session = session();

        // Check if the user is logged in
        $userId = $session->get('user_id');
        if (!$userId) {
            return redirect()->to('/login')->with('error', 'Please log in to view your tasks.');
        }

        // Fetch tasks for the logged-in user
        $tasks = $db->table('tasks')
        ->where('user_id', $userId) // Only fetch tasks for the current user
        ->get()
        ->getResultArray();